Revit 2017 API
RebarConstraint.GetTargetRebarBendNumber Method
 Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public int GetTargetRebarBendNumber()
Visual Basic
Public Function GetTargetRebarBendNumber As Integer
Visual C++
public:
int GetTargetRebarBendNumber()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.' -or- The RebarTargetConstraintType is not 'BarBend'
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace